tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Platform built on V8 to build network applications
brew "node"
# Software environment for statistical computing
brew "r"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Chromium based browser
cask "arc"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Software for iLok devices
cask "ilok-license-manager"
# Control your tools with a few keystrokes
cask "raycast"
# Audio Effects Plugins
cask "soundtoys"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Sound and music editor
cask "ableton-live-suite"
# Chromium based browser
cask "arc"
# App to build and share containerised applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Client for the Google Drive storage service
cask "google-drive"
# VS Code extensions
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"