tap "buo/cask-upgrade"
# GitHub command-line tool
brew "gh"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Platform built on V8 to build network applications
brew "node"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Sound and music editor
cask "ableton-live-suite"
# App to build and share containerised applications and microservices
cask "docker"
cask "font-geist"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Software for iLok devices
cask "ilok-license-manager"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Block your own access to distracting websites
cask "selfcontrol"
# Audio Effects Plugins
cask "soundtoys"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Cloud-based music creation and collaboration platform
cask "splice"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Gecko based web browser
cask "zen"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.vscode-default-python-kernel"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "raunofreiberg.vesper"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "subframe7536.custom-ui-style"
vscode "supermaven.supermaven"
