# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f
tap "homebrew/bundle"
tap "buo/cask-upgrade"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Platform built on V8 to build network applications
brew "node"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# App to build and share containerised applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Software for iLok devices
cask "ilok-license-manager"
# Control your tools with a few keystrokes
cask "raycast"
# Block your own access to distracting websites
cask "selfcontrol"
# Audio Effects Plugins
cask "soundtoys"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# VS Code extensions
vscode "charliermarsh.ruff"
vscode "donjayamanne.vscode-default-python-kernel"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "meteorstudio.cursorcode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
